group_actions_galois.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-31 Tue 23:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Group Actions and Galois Theory</title>
<meta name="author" content="Akash Gopinath" />
<meta name="description" content="Group Actions and Galois Theory" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Group Actions and Galois Theory</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1ce1ee1">Pre-Requisites</a></li>
</ul>
</li>
<li><a href="#org2d843f2">Topics covered</a>
<ul>
<li><a href="#org5cd289a">Group Actions</a></li>
<li><a href="#orgfc957a0">Galois Theory</a></li>
</ul>
</li>
<li><a href="#org604ba99">Notes</a>
<ul>
<li><a href="#org74b6d58">Group Actions Notes</a></li>
<li><a href="#org2ef54d1">Galois Theory Notes</a></li>
</ul>
</li>
<li><a href="#orgade4bae"><span class="todo TODO">TODO</span> </a></div>
</div>
<div id="outline-container-org1ce1ee1" class="outline-3">
<h3 id="org1ce1ee1">Pre-Requisites</h3>
<div class="outline-text-3" id="text-org1ce1ee1">
<p>
Make sure to know all of the material from Abstract Algebra course from Year 2.
</p>
</div>
</div>
<div id="outline-container-org2d843f2" class="outline-2">
<h2 id="org2d843f2">Topics covered</h2>
<div class="outline-text-2" id="text-org2d843f2">
</div>
<div id="outline-container-org5cd289a" class="outline-3">
<h3 id="org5cd289a">Group Actions</h3>
<div class="outline-text-3" id="text-org5cd289a">
<ol class="org-ol">
<li>Group Actions</li>
<li>Orbits and Stabilizers</li>
<li>Counting Orbits and Burnside Theorem</li>
<li>Sylow Theorems</li>
<li>Conjugacy</li>
<li>Counting Orbits using Conjugacy Classes</li>
<li>Subgroup Lattices</li>
</ol>
</div>
</div>
<div id="outline-container-orgfc957a0" class="outline-3">
<h3 id="orgfc957a0">Galois Theory</h3>
<div class="outline-text-3" id="text-orgfc957a0">
<ol class="org-ol">
<li>Recap of Rings and Polynomial Rings (Irreducibility of Polynomials)</li>
<li>Fields and Field Extensions</li>
<li>Quotients of Rings</li>
<li>Field Construction</li>
<li>Constructibility I</li>
<li>Vector Spaces and Degrees</li>
<li>Constructibility II</li>
<li>Splitting Fields</li>
<li>Very Brief Groups Recap</li>
<li>Galois Groups</li>
<li>Not Solving Equations (i.e. Galois Theorem)</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org604ba99" class="outline-2">
<h2 id="org604ba99">Notes</h2>
<div class="outline-text-2" id="text-org604ba99">
</div>
<div id="outline-container-org74b6d58" class="outline-3">
<h3 id="org74b6d58">Group Actions Notes</h3>
<div class="outline-text-3" id="text-org74b6d58">
<ul class="org-ul">
<li><a href="./group_actions/group_actions.pdf">Group Actions Notes</a></li>
<li><a href="./group_actions/galois_theory.pdf">Galois Theory Notes</a></li>
</ul>
</div>
</div>
<div id="outline-container-org2ef54d1" class="outline-3">
<h3 id="org2ef54d1">Galois Theory Notes</h3>
</div>
</div>
<div id="outline-container-orgade4bae" class="outline-2">
<h2 id="orgade4bae"><span class="todo TODO">TODO</span> </h2>
<div class="outline-text-2" id="text-orgade4bae">
<ul class="org-ul">
<li>Add a section on solubility</li>
<li>Maybe add a chapter on simple groups</li>
<li>Maybe add a section on homomorphisms on groups recap section although it is already covered in Year 2 notes</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Akash Gopinath</p>
<p class="date">Created: 2024-12-31 Tue 23:14</p>
</div>
</body>
</html>
